src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СпособыРаспределенияЗатратНаВыходныеИзделия/СпособыРаспределенияЗатратНаВыходныеИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРаспределенияЗатратНаВыходныеИзделия</name>
  <enumValues>
    <name>ПоДолямСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоПлановойСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоВесу</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъему</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>EnumRef.ТочностьГрафикаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>EnumRef.УправлениеМаршрутнымиЛистами</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>EnumRef.СпособыУправленияОперациями</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>EnumRef.ПериодичностьОформленияВыработкиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Назначения</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказПереработчику2_5</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказНаРемонт</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <type>
      <types>EnumRef.ТипыНазначений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаНазначения</name>
    <type>
      <types>EnumRef.ТипыОбъектовНазначений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеОбработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПартииПроизводства/ПартииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПартииПроизводства</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаЗатрат</name>
    <type>
      <types>EnumRef.ГруппировкиЗатратВПроизводствеБезЗаказа</types>
      <types>EnumRef.ГруппировкиЗатратВЗаказеПереработчику</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗатрат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренняяПереработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзделиеНоменклатура</name>
    <comment>Номенклатура (основное изделие)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзделиеХарактеристика</name>
    <comment>Характеристика (основное изделие)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>Номенклатура (продукция)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <comment>Характеристика (продукция)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <comment>Группа продукции (основное изделие)</comment>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПерехода</name>
    <comment>Партии, которые созданы автоматически для перехода на новые партии производства</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <comment>Уникальный идентификатор ссылки</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ПроизводствоВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяемый обработчик получения данных выбора справочника СтруктураПредприятия.
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - значения выбора.
//  Параметры - Структура - параметры выбора.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура СтруктураПредприятияОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 51
		|	СтруктураПредприятия.Ссылка КАК Ссылка,
		|	СтруктураПредприятия.Представление КАК Представление
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Наименование ПОДОБНО &Текст
		|	И НЕ СтруктураПредприятия.ПометкаУдаления
		|	И (СтруктураПредприятия.ПодразделениеДиспетчер
		|			ИЛИ СтруктураПредприятия.ПроизводственноеПодразделение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление";
		
		Запрос.УстановитьПараметр("Текст", "%" + СокрЛП(Параметры.СтрокаПоиска) + "%");
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла; 
								
	КонецЕсли;
	
КонецПроцедуры

// Возвращает параметры производственного подразделения
//
// Параметры:
//  Подразделение	- СправочникСсылка.СтруктураПредприятия - Подразделение для которого требуется получить параметры.
//
// Возвращаемое значение:
//   Структура   - содержит параметры производственного подразделения.
//
Функция ПараметрыПроизводственногоПодразделения(Подразделение) Экспорт
	
	Параметры = ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение);
	Возврат Параметры;
	
КонецФункции

// Определяет используется ли производство версии 2.1
// 
// Возвращаемое значение:
//   Булево - Истина, если используется производство версии 2.1
//
Функция ИспользуетсяПроизводство21() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством");
	
КонецФункции

// Определяет используется ли производство версии 2.2
// 
// Возвращаемое значение:
//   Булево - Истина, если используется производство версии 2.2
//
Функция ИспользуетсяПроизводство22() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2");
	
КонецФункции

#Область ПроизводствоБезЗаказов

// Оформить производство без заказа на основании.
// 
// Параметры:
//  МассивСсылок - Массив
//  ПараметрыДокументов - см. ПроизводствоКлиентСервер.ПараметрыФормированияДокументовПроизводстваБезЗаказов
// 
// Возвращаемое значение:
//  Структура - Оформить производство без заказа на основании:
//  * ОбъектФормы - ДокументОбъект
//  * ТипДокумента - Строка
//  * ЕстьОшибки - Булево -
//  * СписокДокументов - СписокЗначений -
//  * МассивОшибок - ФиксированныйМассив -
//
Функция ОформитьПроизводствоБезЗаказаНаОсновании(МассивСсылок, ПараметрыДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка                                    КАК Ссылка,
	|	ЗаказКлиента.Статус                                    КАК Статус,
	|	НЕ ЗаказКлиента.Проведен                               КАК ЕстьОшибкиПроведен,
	|	ЗаказКлиента.Статус =
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|		И &ИспользоватьРасширенныеВозможностиЗаказаКлиента КАК ЕстьОшибкиСтатус
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В (&МассивСсылок)
	//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказДавальца.Ссылка                                           КАК Ссылка,
	|	ЗаказДавальца.Статус                                           КАК Статус,
	|	НЕ ЗаказДавальца.Проведен                                      КАК ЕстьОшибкиПроведен,
	|	ЗаказДавальца.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовДавальцев.НеСогласован),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовДавальцев.Согласован)) КАК ЕстьОшибкиСтатус
	|ИЗ
	|	Документ.ЗаказДавальца2_5 КАК ЗаказДавальца
	|ГДЕ
	|	ЗаказДавальца.Ссылка В (&МассивСсылок)
	//-- НЕ УТКА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0                                                              КАК НомерГруппыЗатрат,
	|	ЗаказКлиентаТовары.Ссылка.Организация                          КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции) КАК ГруппировкаЗатрат,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)         КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад)
	|	КОНЕЦ                                                          КАК НаправлениеВыпуска,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗаказКлиентаТовары.Подразделение
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ                                                          КАК Получатель,
	|	ЗаказКлиентаТовары.Номенклатура                                КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика                              КАК Характеристика,
	|	ЗаказКлиентаТовары.Серия                                       КАК Серия,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Обособленно
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                                                          КАК Назначение,
	|	ЗаказКлиентаТовары.Ссылка.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)        КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка) КАК ПравилоРаспределения,
	|	ЗаказКлиентаТовары.Количество                                  КАК Количество,
	|	ИСТИНА                                                         КАК ОтражатьЗатратыДокументом,
	|	ЛОЖЬ                                                           КАК ОшибкаВНастройкахМодели
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В (&МассивСсылок)
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|	И (НЕ ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|		ИЛИ НЕ &ИспользоватьРасширенныеВозможностиЗаказаКлиента)
	|	И НЕ ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НЕ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0                                                              КАК НомерГруппыЗатрат,
	|	ЗаказДавальцаПродукция.Ссылка.Организация                      КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукцииИНазначениям) КАК ГруппировкаЗатрат,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)         КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЗаказДавальцаПродукция.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад)
	|	КОНЕЦ                                                          КАК НаправлениеВыпуска,
	|	ВЫБОР
	|		КОГДА ЗаказДавальцаПродукция.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗаказДавальцаПродукция.Подразделение
	|		ИНАЧЕ ЗаказДавальцаПродукция.Склад
	|	КОНЕЦ                                                          КАК Получатель,
	|	ЗаказДавальцаПродукция.Номенклатура                            КАК Номенклатура,
	|	ЗаказДавальцаПродукция.Характеристика                          КАК Характеристика,
	|	ЗаказДавальцаПродукция.Серия                                   КАК Серия,
	|	ВЫБОР
	|		КОГДА ЗаказДавальцаПродукция.Обособленно
	|			И Константы.ВариантОбособленияПродукцииПриПриемеВПереработку =
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияПриПриемеВПереработку.ЗаказДавальца)
	|			ТОГДА ЗаказДавальцаПродукция.Ссылка.Назначение
	|		КОГДА ЗаказДавальцаПродукция.Обособленно
	|			ТОГДА ЗаказДавальцаПродукция.Ссылка.Договор.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                                                          КАК Назначение,
	|	ЗаказДавальцаПродукция.Ссылка.НаправлениеДеятельности          КАК НаправлениеДеятельности,
	|	ЗаказДавальцаПродукция.Спецификация                            КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка) КАК ПравилоРаспределения,
	|	ЗаказДавальцаПродукция.Количество                              КАК Количество,
	|	ИСТИНА                                                         КАК ОтражатьЗатратыДокументом,
	|	ЛОЖЬ                                                           КАК ОшибкаВНастройкахМодели
	|ИЗ
	|	Документ.ЗаказДавальца2_5.Продукция КАК ЗаказДавальцаПродукция
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|	ПО ИСТИНА
	|
	|ГДЕ
	|	ЗаказДавальцаПродукция.Ссылка В (&МассивСсылок)
	|	И ЗаказДавальцаПродукция.Ссылка.Проведен
	|	И НЕ ЗаказДавальцаПродукция.Ссылка.Статус В (
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовДавальцев.НеСогласован),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовДавальцев.Согласован))
	|	И НЕ ЗаказДавальцаПродукция.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И НЕ ЗаказДавальцаПродукция.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И НЕ ЗаказДавальцаПродукция.Отменено
	//-- НЕ УТКА
	|";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента", ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));
	Результаты = Запрос.ВыполнитьПакет();
	
	ДопустимыеСтатусыЗаказКлиента = Новый Массив;
	ДопустимыеСтатусыЗаказКлиента.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	ДопустимыеСтатусыЗаказКлиента.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	ДопустимыеСтатусыЗаказКлиента.Добавить(Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	
	//++ НЕ УТКА
	ДопустимыеСтатусыЗаказДавальца = Новый Массив;
	ДопустимыеСтатусыЗаказДавальца.Добавить(Перечисления.СтатусыЗаказовДавальцев.КПроизводству);
	ДопустимыеСтатусыЗаказДавальца.Добавить(Перечисления.СтатусыЗаказовДавальцев.КОтгрузке);
	ДопустимыеСтатусыЗаказДавальца.Добавить(Перечисления.СтатусыЗаказовДавальцев.Закрыт);
	//-- НЕ УТКА
	
	ЗаказыСОшибкой = Результаты[0].Выгрузить();
	Для Каждого ТекущиеДанные Из ЗаказыСОшибкой Цикл
		
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")Тогда
			ДопустимыеСтатусы = ДопустимыеСтатусыЗаказКлиента;
		//++ НЕ УТКА
		ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЗаказДавальца2_5")Тогда
			ДопустимыеСтатусы = ДопустимыеСтатусыЗаказДавальца;
		//-- НЕ УТКА
		Иначе
			ДопустимыеСтатусы = Новый Массив;
		КонецЕсли;
		
		ПараметрыПроверки                          = ОбщегоНазначенияУТ.ПараметрыПроверкиВозможностиВводаНаОсновании();
		ПараметрыПроверки.Статус                   = ТекущиеДанные.Статус;
		ПараметрыПроверки.ЕстьОшибкиПроведен       = ТекущиеДанные.ЕстьОшибкиПроведен;
		ПараметрыПроверки.ЕстьОшибкиСтатус         = ТекущиеДанные.ЕстьОшибкиСтатус;
		ПараметрыПроверки.МассивДопустимыхСтатусов = ДопустимыеСтатусы;
		ПараметрыПроверки.ПрерыватьВыполнение      = Ложь;
		
		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСПараметрами(ТекущиеДанные.Ссылка, ПараметрыПроверки);
		
	КонецЦикла;
	
	Для Каждого ТекущиеДанные Из Результаты[Результаты.ВГраница()].Выгрузить() Цикл
		СтруктураСтрокиИзделия = ПроизводствоКлиентСервер.СтруктураСтрокиИзделия();
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиИзделия, ТекущиеДанные);
		ПараметрыДокументов.ИзделияПоСпецификации.Добавить(СтруктураСтрокиИзделия);
	КонецЦикла;
	
	Возврат Обработки.ОформлениеПроизводстваБезЗаказов.СформироватьДокументыПоПараметрам(ПараметрыДокументов);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетДолейСтоимости

Функция ДоступнаРасшифровкаРасчетаДолиСтоимости(СпособРаспределенияЗатратНаВыходныеИзделия) Экспорт
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости Тогда
		Если ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25() Тогда
			ЕстьДоступ = ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЦеныНоменклатуры25);
		Иначе
			ЕстьДоступ = ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЦеныНоменклатуры);
		КонецЕсли;
	Иначе
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Возврат ЕстьДоступ;
	
КонецФункции

#КонецОбласти

Функция ДоступноРабочееМестоЗаказыПереработчикам() Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство")
		И Пользователи.РолиДоступны("ИспользованиеРабочегоМестаЗаказыПереработчикам") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

//++ НЕ УТ

Функция ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(МассивЗаказов, ХозяйственнаяОперация) Экспорт
	
	ОбъектыОснований = МассивЗаказов;
	
	РеквизитыШапки = Документы.ДвижениеПродукцииИМатериалов.ДанныеЗаполненияНакладной(ОбъектыОснований, Новый Структура("ХозяйственнаяОперация", ХозяйственнаяОперация));
	РезультатыПроверки = Документы.ДвижениеПродукцииИМатериалов.ПроверитьДанныеЗаполненияНакладной(РеквизитыШапки);
	
	ПараметрыОснования = Новый Структура;
	Если РеквизитыШапки.ПоРаспоряжениям Тогда
		ПараметрыОснования.Вставить("РеквизитыШапки", РеквизитыШапки);
		ПараметрыОснования.Вставить("МассивЗаказов",  ОбъектыОснований);
	Иначе
		ПараметрыОснования.Вставить("ОбъектыОснований", ОбъектыОснований);
		ПараметрыОснования.Вставить("ХозяйственнаяОперация", РеквизитыШапки.ХозяйственнаяОперация);
	КонецЕсли;
	
	Возврат Новый Структура("Основание, РезультатыПроверки", ПараметрыОснования, РезультатыПроверки);
	
КонецФункции

Функция ДокументыДвиженияПродукцииИМатериаловПоПараметрам(ПараметрыДокументов) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"ОбщийМодуль.ПроизводствоВызовСервера.ДокументыДвиженияПродукцииИМатериаловПоПараметрам");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	МассивОбъектов = Документы.ДвижениеПродукцииИМатериалов.ДокументыПоПараметрам(ПараметрыДокументов);
	Результат = Новый Структура;
	
	Если МассивОбъектов.Количество() = 1 Тогда
		ЗначениеВДанныеФормы(МассивОбъектов[0], ПараметрыДокументов.ОбъектФормы);
		Результат.Вставить("ОткрытьФормуНового");
	Иначе
		
		СозданныеДокументы = Новый Массив;
		Для Каждого ТекДокумент Из МассивОбъектов Цикл
			ТекДокумент.Записать(РежимЗаписиДокумента.Запись);
			СозданныеДокументы.Добавить(ТекДокумент.Ссылка);
		КонецЦикла;
		
		Если СозданныеДокументы.Количество() > 1 Тогда
			
			ПараметрыФормы = Новый Структура("КлючДанных, ВидимыеКолонки, СобытияОбновления",
				"ВыпускПродукцииБезЗаказаНаОсновании", Новый Массив, Новый Массив);
			
			ПараметрыФормы.ВидимыеКолонки.Добавить("Номер");
			ПараметрыФормы.ВидимыеКолонки.Добавить("Дата");
			ПараметрыФормы.ВидимыеКолонки.Добавить("ТипЗначения");
			ПараметрыФормы.ВидимыеКолонки.Добавить("ХозяйственнаяОперация");
			ПараметрыФормы.ВидимыеКолонки.Добавить("Организация");
			ПараметрыФормы.ВидимыеКолонки.Добавить("Подразделение");
			ПараметрыФормы.ВидимыеКолонки.Добавить("НаправлениеДеятельности");
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыДвиженийПродукцииИМатериалов") Тогда
				ПараметрыФормы.ВидимыеКолонки.Добавить("Статус");
			КонецЕсли;
			ПараметрыФормы.ВидимыеКолонки.Добавить("Дополнительно");
			
			ПараметрыФормы.СобытияОбновления.Добавить("Запись_ДвижениеПродукцииИМатериалов");
			
			Результат.Вставить("ИмяФормы", "ОбщаяФорма.ФормаСозданныхДокументов");
			Результат.Вставить("Параметры", ПараметрыФормы);
			
			Владелец = Пользователи.АвторизованныйПользователь();
			УстановитьПривилегированныйРежим(Истина);
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, СозданныеДокументы, ПараметрыФормы.КлючДанных);
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
		Результат.Вставить("КоличествоСозданныхДокументов", СозданныеДокументы.Количество());
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	КоличествоОпераций = ПараметрыДокументов.ОбъектыОснований.Количество();
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоОпераций);
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Возврат Результат;
	
	
КонецФункции

Функция СоздатьАктВыполненныхВнутреннихРаботПроверкаОснований(ОбъектыОснований) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстЗапроса =
	"
	//++ НЕ УТКА
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка                          КАК Ссылка,
	|	ТаблицаТовары.НомерГруппыЗатрат               КАК НомерГруппыЗатрат,
	|	МАКСИМУМ(ТаблицаТовары.ВнутренняяПереработка) КАК ВнутренняяПереработка,
	|	МАКСИМУМ(ТаблицаТовары.ОрганизацияДавалец)    КАК ОрганизацияДавалец
	|ПОМЕСТИТЬ ГруппыЗатрат
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&ОбъектыОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.НомерГруппыЗатрат
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерГруппыЗатрат
	|;
	|
	//-- НЕ УТКА
	|////////////////////////////////////////////////////////////////////////////////
	// Получатели выходных изделий (производство без заказа)
	|ВЫБРАТЬ
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ТаблицаТоваров.ВнутренняяПереработка
	|			ТОГДА ТаблицаТоваров.ОрганизацияДавалец
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА Реквизиты.Организация
	|	КОНЕЦ								КАК Организация,
	|	Реквизиты.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаТоваров.Получатель			КАК Подразделение
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК Реквизиты
	|		ПО ТаблицаТоваров.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТаблицаТоваров.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТаблицаТоваров.Ссылка В(&ОбъектыОснований)
	|	И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ТаблицаТоваров.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.НаправлениеДеятельности,
	|	ТаблицаТоваров.Получатель,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ТаблицаТоваров.ВнутренняяПереработка
	|			ТОГДА ТаблицаТоваров.ОрганизацияДавалец
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА Реквизиты.Организация
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Получатели побочных изделий (производство без заказа)
	|ВЫБРАТЬ
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА НЕ ТаблицаТоваров.ВладелецИзделия = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.ВладелецИзделия
	|		КОГДА СпрПартииПроизводства.ВнутренняяПереработка
	|			ТОГДА СпрПартииПроизводства.Организация
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА Реквизиты.Организация
	|	КОНЕЦ								КАК Организация,
	|	Реквизиты.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаТоваров.Получатель			КАК Подразделение
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ПобочныеИзделия КАК ТаблицаТоваров
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК Реквизиты
	|	ПО ТаблицаТоваров.Ссылка = Реквизиты.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО ТаблицаТоваров.Номенклатура = СпрНоменклатура.Ссылка
	//++ НЕ УТКА
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|	ПО СпрПартииПроизводства.Документ = ТаблицаТоваров.Ссылка
	|	И СпрПартииПроизводства.Код = ТаблицаТоваров.НомерГруппыЗатрат
	|	И НЕ СпрПартииПроизводства.ПометкаУдаления
	//-- НЕ УТКА
	|	
	|ГДЕ
	|	ТаблицаТоваров.Ссылка В(&ОбъектыОснований)
	|	И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ТаблицаТоваров.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.НаправлениеДеятельности,
	|	ТаблицаТоваров.Получатель,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА НЕ ТаблицаТоваров.ВладелецИзделия = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.ВладелецИзделия
	|		КОГДА СпрПартииПроизводства.ВнутренняяПереработка
	|			ТОГДА СпрПартииПроизводства.Организация
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА Реквизиты.Организация
	|	КОНЕЦ
	|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	//++ НЕ УТКА
	ТекстыЗапросов.Добавить(Документы.ЭтапПроизводства2_2.ТекстЗапросаПроверкиОснованийАктовРабот());
	//-- НЕ УТКА
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Запрос.Текст = Запрос.Текст + "
	|;
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаТоваров.Организация)							КАК Организация,
	|	МАКСИМУМ(ТаблицаТоваров.НаправлениеДеятельности)				КАК НаправлениеДеятельности,
	|	МАКСИМУМ(ТаблицаТоваров.Подразделение)							КАК Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТоваров.Организация)				КАК РазличныеОрганизации,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТоваров.НаправлениеДеятельности)	КАК РазличныеНаправленияДеятельности,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТоваров.Подразделение)				КАК РазличныеПолучатели
	|ИЗ
	|	ВтТовары КАК ТаблицаТоваров
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаТоваров.Организация) ЕСТЬ НЕ NULL";
	
	Запрос.УстановитьПараметр("ОбъектыОснований", ОбъектыОснований);
	
	Ошибки = Запрос.Выполнить().Выбрать();
	РеквизитыШапки = Новый Структура("Организация, НаправлениеДеятельности, Подразделение");
	Результат = Новый Структура;
	
	Если Ошибки.Следующий() Тогда
		
		ЕстьОшибки = Ложь;
		ТекстОшибки = НСтр("ru = 'В документах-основаниях различаются значения:';
							|en = 'Values are different in base documents:'");
		Если Не Ошибки.РазличныеОрганизации = 1 Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = '- Организаций';
															|en = '- Companies'");
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не Ошибки.РазличныеПолучатели = 1 Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = '- Получателей работ';
															|en = '- Work recipients'");
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не Ошибки.РазличныеНаправленияДеятельности = 1 Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = '- Направлений деятельности';
															|en = '- Lines of business'");
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если ЕстьОшибки Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Оформление документа невозможно!';
															|en = 'Cannot register the document.'");
			Результат.Вставить("ЕстьОшибки");
			Результат.Вставить("ТекстОшибки", ТекстОшибки);
		Иначе
			ЗаполнитьЗначенияСвойств(РеквизитыШапки, Ошибки);
		КонецЕсли;
	Иначе
		ТекстОшибки = НСтр("ru = 'Отсутствуют данные для заполнения!';
							|en = 'No data to populate.'");
		Результат.Вставить("ЕстьОшибки");
		Результат.Вставить("ТекстОшибки", ТекстОшибки);
	КонецЕсли;
	Результат.Вставить("РеквизитыШапки", РеквизитыШапки);
	
	Возврат Результат;
	
КонецФункции

//-- НЕ УТ

#КонецОбласти
